In [2]:
import pandas as pd

In [3]:
df_one = pd.DataFrame(columns=["Column 1", "Column 2"])

In [4]:
df_one

Empty DataFrame
Columns: [Column 1, Column 2]
Index: []

In [5]:
df_one.columns = ["First", "Second"]

In [6]:
df_one

Empty DataFrame
Columns: [First, Second]
Index: []

In [7]:
new_data = {
    "First" : [1, 2, "foo"],
    "Second" : [3, 4,"bar"]
}

In [8]:
df_two = pd.DataFrame(new_data)

In [9]:
df_two

  First Second
0     1      3
1     2      4
2   foo    bar

In [10]:
df_combined = pd.concat([df_one, df_two])

In [11]:
df_combined

  First Second
0     1      3
1     2      4
2   foo    bar

In [12]:
data_1 = {
    "First" : [5, 6, "Hellow"],
    "Second" : [7, 8, "World"]
}

In [13]:
df_one = pd.DataFrame(data_1)

In [14]:
df_one

    First Second
0       5      7
1       6      8
2  Hellow  World

In [15]:
df_combined = pd.concat([df_one, df_two])

In [16]:
df_combined

    First Second
0       5      7
1       6      8
2  Hellow  World
0       1      3
1       2      4
2     foo    bar

In [17]:
df_combined.reset_index(drop=True, inplace=True)

In [18]:
df_combined

    First Second
0       5      7
1       6      8
2  Hellow  World
3       1      3
4       2      4
5     foo    bar

In [19]:
data_3 = {
    "Third" : ["a", "b", "c"]
}
df_three = pd.DataFrame(data_3)

In [20]:
df_three

  Third
0     a
1     b
2     c

In [21]:
df_combined_3 = pd.concat([df_combined, df_three])

In [22]:
df_combined_3

    First Second Third
0       5      7   NaN
1       6      8   NaN
2  Hellow  World   NaN
3       1      3   NaN
4       2      4   NaN
5     foo    bar   NaN
0     NaN    NaN     a
1     NaN    NaN     b
2     NaN    NaN     c

In [23]:
df_combined_3_a = pd.concat([df_combined, df_three], axis=1)

In [24]:
df_combined_3_a

    First Second Third
0       5      7     a
1       6      8     b
2  Hellow  World     c
3       1      3   NaN
4       2      4   NaN
5     foo    bar   NaN

In [25]:
df_combined_3_0 = pd.concat([df_combined, df_three], axis=0)

In [26]:
df_combined_3_0

    First Second Third
0       5      7   NaN
1       6      8   NaN
2  Hellow  World   NaN
3       1      3   NaN
4       2      4   NaN
5     foo    bar   NaN
0     NaN    NaN     a
1     NaN    NaN     b
2     NaN    NaN     c

In [27]:
df_combined_3_2 = pd.concat([df_combined, df_three], axis=2)
df_combined_3_2

ValueError: No axis named 2 for object type DataFrame